app/controllers/businesses_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."ip_address" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["ip_address", "208.184.3.194"]]
---

    if unicorns.present?
      remote_ip =  remote_ip()
      @user = User.where(ip_address: remote_ip).first