app/controllers/settings_controller.rb

  def update
    @setting = Setting.find(params[:id])
    @setting.update!(setting_params)
---
SELECT  "settings".* FROM "settings" WHERE "settings"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "settings" SET "search_term" = $1, "search_type" = $2, "updated_at" = $3 WHERE "settings"."id" = $4  [["search_term", "Restaurants"], ["search_type", "luxury"], ["updated_at", "2018-06-06 11:48:02.043202"], ["id", 1]]